[
{
	"title" : "AITA for ‘fat shaming’ my roommate because she wouldnt stop talking about how fat America is.",
	"body" : "I (25f) am an American who has been living in London for about six months now. My roommate B (23f) has been nice for the most part, and I’ve even come to enjoy her company. My only issue is that she is always taking jabs at America. To clarify, I don't think America is above criticism, and I have no problem shooting shit from time to time. When I first met her I would laugh along, and didn't feel any type of way about it. However, it’s become too frequent, and as time has gone on, I’ve started to notice an obnoxious air of superiority every time she does this, which really makes me feel like it’s not all in good fun anymore. She’ll even refuse to believe me if I correct her when she says something untrue (i.e., when she said, “Americans are all so stupid because all of your tests are multiple choice,” and I told her that wasn't true, she insisted the schools I went to must be different from most schools in America). I’ve tried to go along with it, as I don't want to be an overly sensitive person, but it’s starting to get on my nerves.All of my frustrations came to a head last night when she started talking about how disgusting it was that America is so fat (a topic I’ve heard her talk about many times). I was in a bad mood, I still tried my best to ignore her, but she just kept going. I’ve always had to bite my tongue when she talks about America’s obesity epidemic because B is overweight herself.  I finally snapped and stopped biting my tongue and said, “Don’t you think this is a little ironic?” she gave me a confused look and asked why she would think that, to which I replied “Well I’m an American, and I’m a lot thinner than you. This conversation would make more sense if you were the thin one.” She absolutely exploded and told me I had no right to make comments about her body. After that she locked herself up in her room, and now she refuses to talk to me. I made some beef stew for dinner tonight as a peace offering, but she still won't acknowledge my presence. I do feel bad about hurting her feelings, but I also feel like she shouldn't dish it if she can't take it.",
	"decision" : "Not the A-hole"
},
{
	"title" : "AITA for refusing to make my daughter issue an apology to the class clown and telling the mother her daughter is a brat.",
	"body" : "My daughter (Ava 14) is a good kid in general. She gets good grades and is pretty quiet at school sticking to her friend group and not causing issue. I was surprised getting a call today that I needed to pick her up since she got in trouble at school.Basically what happened was the class clown (Mia) was messing around in class was dancing/singing during class for no reason. My daughter had enough and told her to shut the fuck up, no one likes her and she is the reason no one enjoys school. A student recorded the whole thing. Mia ended up crying and principal office they were both sent.The principal wanted my daughter to give an apology to her. I told them no and that we are leaving. This started the mom telling me her daughter needs an apology. I told her that her kid is a brat and she should learn how to behave in class. That if she wasnt annoying as all hell my daughter wouldn’t have snapped after 5 months.She called me a jerk and my daughter is iffy if she should apologize so I am making this.Edit to clear stuff upThis was asked, the teacher was trying to get her back to her seat, this was in a middle of lesson. She was trying and Mia was ignoring her and kept goingAlso since some people are confused, this wasn’t a one time thing, according to my daughter she had 5 months of dealing with Mia and her behavior.Another question I’ve seen, does she have ADHD. No idea, not my kid. If she does it make explain some things but doesn’t excuse it.Update 1: so some stuff has happened since it posted this, it got out what my daughter did to the other parents and they have sent me email receipts of how many times they tried to get the school to do something about Mia. Most of the parents are pissed Ava had to go to the principals.The principal has sent an email about conduct in the classroom and a new policy that if kids disrupt a class they will be taking action. Don’t know what that means yet.",
	"decision" : "Not the A-hole"
},
{
	"title" : "AITA for asking my college classmate about her pubic hair?",
	"body" : "So last weekend, at college, my roommate invited a bunch of people into our dorm, a mix of girls and guys, and we were all drinking, and somehow the conversation got to a point where one of the girls (who I know, we're not close friends, but we definitely had a friendly acquaintance relationship, at least until this incident) asked me if I was circumsised. I felt the question was invasive and personal so I responded, "what's your pubic hair situation", trying to give her a taste of her own medicine so that she would see how it feels to be asked an invasive question about your private area (and my question was less personal than hers - it was about a styling decision, which is done of your own volition and easily changeable, as opposed to something you had no say in and have no way to change) and hopefully realize she had overstepped the line, but instead she just blushed and ran out of the dorm room.Now my roommate is mad at me and wants me to apologize to her, but I don't think I did anything wrong here - if she doesn't like having me ask her questions about her private area, she shouldn't be asking me questions about mine.Was I in the wrong here?",
	"decision" : "Not the A-hole"
},
{
	"title" : "AITA for flipping out after he ate my son's food?",
	"body" : "I don't think I'm an AH, honestly. However, literally everyone I've spoken to is against me on this because "it's just food, I would never make someone feel like shit over food, blah blah". So, here I am.30f. I have a 13yo son named Colby with my ex husband. Last year my son desperately wanted to go to Japan because his father currently lives there and my son had been there multiple times for visits during the summer and fell in love with it. He begged me to let him live with his dad for a year and while it broke my fn heart and gave me extreme anxiety, I agreed. I couldn't say no. He went there for a year and came back home in August of this year. As many could imagine, Japan has much different cuisines than the US does and while my son wouldn't complain about anything I put in front of him, he did make a few comments about missing Japanese dishes. So I went through a few websites, got a hold of his dad, etc and I was able to get some of the ingredients and recipes shipped out to me. His favorite one is some type of noodles with a dark brown spicy sauce. I can't remember the name off the top of my head but since it's his favorite, I have his father send me out the noodles and sauce so my son can prepare it for himself at home, as well as buying him the fresh ingredients needed.Well, me and my husbands daughter (9) asked Colby the day before yesterday if she could have some of his noodles. He said no. He only said no because he's made the dish for her before and she wasted the entire thing because it was too spicy. So she doesn't like it and therefore he said no and reminded her that she didn't like it. Before my daughter could even respond, my husband pipes up with "give her some, there's no reason why you can't share". So I stepped in and said no, and that she's already had it and threw it in the trash and this is his food. He doesn't have to share his food. He just kind of walks off. Well, this morning my son asked where all of his noodles were (4 packages) and my husband says "I ate them". I asked why TF he would do that and he said "because I wanted to". To me this felt like a big "fuck you" because I told him my son didn't have to share his food, so I did lose it. He did this on purpose. I just know it. I told him he was a fucking pig on a power trip and he should be ashamed of himself for eating my son's food. He says I'm ridiculous and I'm an AH for calling him a pig (because he's overweight) simply because he was hungry and wanted to eat. Everyone else says I'm an AH too, as I said. AITA?",
	"decision" : "Not the A-hole POO Mode"
},
{
	"title" : "AITA for not defending my wife wanting to attend a funeral with our baby, thus causing her to miss it?",
	"body" : "My wife and I have a 6-month-old baby girl. Due to postpartum anxiety, which she is being treated for, my wife struggles with leaving our daughter with anyone outside myself or my mother, who lives with us. This hasn’t been an issue thus far and as I said, she’s in therapy so little by little, it’s been getting better.Unfortunately, my nephew (who was also 6 months old) passed away a few weeks ago. He had been in poor health since birth but it’s still obviously devastating for the entire family, especially my brother and SIL. They held the services the following weekend.I was in consistent contact with my brother and we were discussing the funeral. He said he knew it was a lot to ask, but could we please not bring our daughter. I said I completely understood and didn’t even intend to. One, in my opinion, babies do not belong at funerals. Two, this is a funeral for a baby of a similar age. Why would one want to bring up that reminder? My brother said he knows how my wife is about leaving the baby so they understand if she can’t come.Well, my wife became irritated when she found out I “didn’t defend her”. She reminded me that she doesn’t trust anyone to take care of the baby outside me and my mom, who obviously have to be at the funeral. She doesn’t want to miss it either, but also won’t agree to leave the baby with anyone else. We have several family members on her side that we are close to, as well as good friends who also have kids. I said even if she just went to the service and not the gathering afterward, that’d just be an hour. She said no, she can’t handle the thought of leaving her with anyone else. I said that’s understandable and that clearly, my brother and SIL would rather her not come if it means not having a baby at the funeral. She continued to complain.Finally, I said she has two choices and she needs to make one, I don’t care which it is. I won’t’ hold it against her either way. One, either allow someone else to watch the baby for an hour. Two, stay home with the baby. She says that I’m not even pretending to be on her side and I said I’m not, because this isn’t even about us.My wife ended up staying home with the baby. When my mother and I returned later that afternoon, she shut us both out. Eventually, she calmed down but she has made comments here and there making it clear that she feels I should’ve tried to convince my brother to let the baby come. AITA?",
	"decision" : "Not the A-hole"
},
{
	"title" : "AITA for painting a curse word on the wall of my friend's new house?",
	"body" : "My friend and his wife just bought their first home. It is a fixer upper and I have been helping them out with the fixing.My father was a handyman and contractor so I have a lot of skills and experience with doing maintenance, repairs, and upgrades on a house. I also have pretty much all the tools I need to do most of the work.This last weekend I was helping paint the dining room. I had everything set up the way I wanted and I was ready to go. For some fucking reason his wife decides to let their dogs into the room I'm painting.One of them steps in the roller tray and then jumps up on me. His wife laughed it off like it was not a big deal that I had paw prints on me. I also had to throw out that primer because  it now had mud in it. I had told them both to let me do the work in peace.After I prepared a new tray of paint I wrote the word "FUCK" in huge letters on the wall. IN PRIMER.For those of you who may not know primer is the coat of paint that you put down before the actual paint. For lack of a better word it sticks to the wall better and when it dries it creates a better surface for the paint to stick to.His wife saw it and freaked. She said I was drawing profanity in her house. I told her it was primer and to stay out of my way.I then finished the job and went home. My friend called me and said that I had really upset his wife with my childishness and that she would not let me back until I apologized. I asked him what I was apologizing for. He said that I wrote a curse word on his wall. I asked him to provide a picture. He said he couldn't since I had painted over it. I asked what the problem was since the word wasn't there any more. He said that I needed to apologize. I said that him wanting me to apologize was in no way the same as me needing to apologize. He said that I could not come back until I did. No problem for me. I was helping him for free on my weeks off from work.He called me two days later and asked if I was coming to finish painting since I would be away at work for three weeks. I said I wasn't ready to apologize yet and maybe I would when I got back. I probably won't.Now she is telling everyone that I'm a shitty person for leaving a job half finished. I tell everyone who asks that I was working for free and that they told me not to come back.Now there is a big fight in our friend group between the people who think I should keep the peace and those who think she is being an entitled whiner. No one else is volunteering to help at their house and now either they have to half ass the job or pay someone. I'm getting hell for that too.AITA?",
	"decision" : "Not the A-hole"
},
{
	"title" : "AITA for cancelling my daughter's birthday celebration?",
	"body" : "EDIT: He was adopted a year back._________________________________________________________________It was my daughter Rachel's (11 F) birthday yesterday. I have another child, Ethan, (10 M) who's adopted. Rachel insists that he's not a "proper" member of family as he's not related to us. My wife Emily and I had attempted to convince her (although it was mostly I who did), but it had not worked so we gave it up.We had planned to have lunch at a restaurant and we took the car. Ethan wanted to sit in front, but Rachel told him "Sorry, but only proper members of the family get to sit in front, and you're not really their child."He was shocked, and I asked her to take back what she had said, but my wife asked me to not start an argument as it was her birthday. Ethan did sit back with Emily in the back, and so I did not argue.We went to the restaurant, and she wanted an expensive dish. I ordered it, and Ethan said that he wants the same stuff. But Rachel did not like that, she said:"You want an expensive dish when he's not even your Dad in reality? I'd have thought you'd be more grateful as your parents are dead and you're adopted now."I asked her to apologize immediately as I could see that it had really hurt him, but she just shrugged and said, "Well, if you want to have it, go ahead. I don't care anyway." But I told her "You are going to care because your birthday's cancelled, we're headed back." I asked them to head back to the car and she yelled at me and said she was just joking, that I cannot do that, etc.We had a really huge argument but in the end I got back them back to the car. My wife says that although what she said was distasteful, cancelling her birthday was extremely uncalled for and she's mad at me for having ruined her day completely.AITA?",
	"decision" : "Not enough info POO Mode"
},
{
	"title" : "AITA for slut-shaming a slut-shamer?",
	"body" : "I admit this is petty but some mutual friends think I’m the AH and it doesn’t really seem to rise to the level of AH to me so another opinion would be helpful.I (19F) am not sexually active by choice.  Not for any moral reason, I just want to focus on uni without extra complications and I’d rather my first be with someone I care about and feel completely comfortable with. Guys get weird about it when sex comes up. Either they fetishize it, turn it into a challenge, or lose interest. The guys that get all excited about a “0 bodycount” are the woooorst and it’s my #1 dating pet peeve.There is a guy we’ll call Bob that hangs around my friend group because he’s one of the other guy’s roommate. Bob has good moments, but he acts like a major douche-canoe when dating or sex comes up. Brags about sleeping with a lot of girls, but also looks down on them for being loose. I try to avoid Bob.Anyway, Bob asked me out before Thanksgiving break. Like two days before that, I heard him talking to one of the guys about a  girl he went on a date with and he said he hit it and quit it because he doesn’t date sluts. So when Bob asked me out, I said no thanks. He pressed for a reason and I told him that I heard him talk about all his hookups and I don’t date sluts. You should have seen the look on his face. He said it wasn’t really that many and he was exaggerating a little, I’m “wife material” so he’s not looking to hookup. I said if his body count was over 0 he was too easy to be husband material.Bob lost his shit about it and the friend group is split. Some think it’s hilarious and Bob got a taste of his own medicine, others think it was wrong to slut-shame him even if he is kind of a bellend.",
	"decision" : "Not the A-hole"
},
{
	"title" : "AITA for making it clear that if he keeps the grandkids away then he will not be getting an inheritance",
	"body" : "I will try to keep this short, my son and his wife home needed repairs. Before living together we had a good relationship, the problem came when his wife wouldn’t follow the home rules.They are pretty simple like clean up after  yourself, don’t be loud at night and the big one was no drinking in the home. No alcohol in the home. We made this really clear and my son knows his mother has trauma related to alcohol. We informed DIL in general terms also.The first few month seemed fine and it turned for the worse when the weather got cold. We couldn’t prove it at the time but we were sure they were drinking. It came to head when cleaning my wife found wine in the attic. She was pissed and poured it out. Apparently it was a 300 dollar bottle and it cause a huge fight between her and DIL.We let them stay until the renovations were done and they have been out two weeks ago. Relationship has been tense and I figured we just need time apart. My son met up with me and told us we can’t see our grandkids anymore. That the incident made him rethink our relationship.I told him that was bullshit, the he knew the one big rule in the home, caused stress to his mother ( my wife). He told me it was final and I told him if he goes through with this he will be out of the will.This started another argument and he is pissed at me.Edit: the wine was open.Edit 2: I called my sister, and asked her to tell me to track down the price of the wine. My wife sent a picture of the bottle when this happened.You were right, it wasn’t 300 but around 25. I need to talk to my son and find out why she lied about that.Edit: long night, I had a conversation after I sent a text sayin that the bottle was only 25. During the argument when that price came out DIL thought my wife poured out all the wine, there was a case up there worth 300. My son removed it when he realized she just found the one left out and went with the price instead of informing us there was more wine.",
	"decision" : "Not enough info"
},
{
	"title" : "AITA for refusing to go in another room so my fiancé and the baby could sleep alone?",
	"body" : "My fiancé "Jen" (29f) just gave birth to our daughter 2 months ago. She strictly breastfeeds, so as you can imagine, she gets far less sleep than I do. During the day I help with changing or holding her but all feedings are up to Jen (the baby outright refuses a bottle- we have tried several times, but ultimately we are both okay with this).Anyways, I'm kind of a independent start up video game developer. I did make one video game 2 years ago but it honestly wasn't that great. So while I do get revenue from it, it's definitely not much or even a liveable wage. This time around however I'm working with 4 other people and the game is turning out great. I also work a 9-5. But after getting home, having dinner with my fiancé and looking after the baby for awhile, I jump on and work on the game.For the past 2-3 nights I have been up til 1-2am working on the game and I have been ultra tired. I snore like a maniac when I'm tired. It's super embarrassing because I truly sound like a mack truck. But yesterday the baby had her 2 months shots and she was so fussy. Cried way more than normal. It was super hard for my fiancé to get her to sleep. I finally went to bed around 2am and my fiancé immediately asked me to sleep on the couch so I wouldn't wake the baby with my snoring. I said no. I was so tired and the couch is not comfortable at all. I had to work early. I wanted to sleep. She didn't fight it but she called me a "fucking prick" and walked out of the room with the baby. I woke up this morning to the baby in the crib in the nursery and my fiancé asleep on the floor with no pillows/blankets. She still won't talk to me.",
	"decision" : "Asshole"
},
{
	"title" : "AITA for brushing my daughter’s friend’s extremely matted hair out so she avoid a drastic cut?",
	"body" : "My daughter has a friend, A (13F), who has been going through some health issues that I don’t want to put here. A’s mum passed away when she was little so it’s just her and her dad. Since he has started dating his girlfriend (we’ll call her C) A’s needs have been pushed to the side a little and he’s just not noticed that A has been struggling. She’s doing better now after getting the help she needed.However, A’s hair has been extremely matted as it had not been brushed for months. A had been hiding her hair under hats and hoods at home and trying to disguise it at school in buns. She stayed over at the weekend and I only found out about her hair when they came downstairs after getting a comb stuck in A’s hair trying to fix it. I comforted A as she was ashamed about her hair but had hoped that she and my daughter could fix it. My daughter convinced her to tell me about it as she had been scared to say anything to anyone as she thought she would be judged as her dad’s girlfriend has made comments about her appearance when she was going through her health issues. When A was going through her issues, I made it clear to her and my daughter that our home is a judgement free zone and if she ever wanted to come to me or my husband for help then she would get it. A then asked for help detangling her hair. So that’s what I did. We put on some films and worked on detangling A’s hair. It took hours, but it was doable.When A went home on Sunday, her hair was completely detangled and neatly braided into two dutch braids. She was happy and thanked me for helping with her hair. Then Monday I got an angry phone call from C because she was meant to be taking A to get her hair cut due to how matted her hair was. Apparently C and A’s dad had noticed how bad it was and C had told me that she would get it sorted. C is mad because the salon they were going to had charged her a cancellation fee for cancelling the day of the appointment. C wants me to pay her back for the cancellation fee as it’s my fault for fixing A’s hair when they were going to get it cut out. I told her that I wouldn’t be paying it, I just did the right thing by A instead of going to the extreme option straight away. C then said that A was no longer allowed to be friends with my daughter and they would sue me for the cancellation fee. It was £60 (half the cost of the cut).My daughter told me that A knew about C wanting to cut her hair and A didn’t want the hair cut which is why she went to my daughter for help. A like my own daughters has long hair, so cutting the matted hair out would have meant her losing well over half of the length of her hair.AITA for brushing out A’s hair so she avoided getting a drastic cut.Update: This got more attention than I thought it would. I would just like to clarify a couple things. 1. While I am not going to go fully into A's health issues, the matted hair is the result of a depressive episode. Once things got better, she was just very embarrassed by the state her hair was in but didn't know how to fix it. So she hid it and it got worse. She is able to brush and wash her hair when she's ok. 2. A isn't being neglected by her dad. He knows he hasn't been the best dad to A and is trying to be better when it comes to her. Since A's health issues, he has been seeking help. I'm not going to report a man who I can see is trying to get better as a parent.A's dad (I'll call him J) came round earlier as he wanted to talk to me. A and C had gotten into a shouting match yesterday because of the cancelled appointment. C had told A that she wasn't allowed to see my daughter anymore until I paid the money I owed - this was news to J - and A told C that she was going to continue seeing her friend. A also told C that she hated her and that if anyone was going to take the place of her mum it would be me because I care about A as a person not just her appearance. J wanted to know what had happened with A and why I owed C money. I explained it all to J and he was horrified to learn that C was going to cut A's hair short instead of helping her. He had been under the impression that the appointment had been to get her hair detangled and wouldn't have consented to A getting a big chop. He hadn't realised how focused C had become on A's appearance with her hair. He told me that he wasn't going to stop A coming around as he knows how important my family is to her. When her mum died and he fell apart, we provided the stability they both needed. I told J that A is always welcomed here and she knows it, but it's her dad that she needs. She needs him to be there for her and to support her through whatever she is going through, having her dad will mean more to her than having me there. J agreed with this, and that he knows he's not been the dad that she needs and is going to try and be better for her. He's asked if I could recommend a family therapist who could help them, and I gave him a few names. Since A started going through her issues, J has stepped up. He's not the same dad that he was when they started but he does still have a way to go to be dad of the year.Since speaking with J I've had angry texts from C, furious that I 'went behind her back' and spoke with J when she was dealing with the issue. In the string of angry texts she sent me, she said horrible things about myself, A and my daughter. I'm not engaging with her anymore, she's a walking red flag. I screenshotted them before blocking C and sent them to J's work phone (J gave me his work number when he started dating C because she had been screening and deleting messages before he saw them. She doesn't have access to his work phone.)  My daughter has been messaging A making sure she is ok, and she will be coming to stay at the weekend as she doesn't want to be at home when C collects her stuff. I'm not sure what is going on with that relationship, nor do I want to know but it does sound like J is finally putting A first.",
	"decision" : "Not the A-hole"
},
{
	"title" : "AITA for siding with my daughter that she doesn’t need to invite her sister to the “popular table”",
	"body" : "Both of my daughters are in highschool, my oldest ( Cindy) is 16 and my youngest (Emily)is 14. Now Cindy is quite popular, she is on the volleyball team and has a huge friend group. My youngest isn’t very popular and her friend (Beth) is her main friend or ex friend. It also doesn’t help that she is into hobbies most other high schoolers don’t care about.Emily and Beth got into a fight and Beth is not speaking to her anymore. She is sitting alone at lunch now. This came out yesterday and my husband wants Cindy to invite her to sit with her group of friends at the “popular table”. Cindy refused saying she doesn’t want to do that.My husband was mad but when he tried to get me to back him up I told him Cindy has ever right to not want her little sister in her friend group. That you can’t do that do her and Emily needs to make her own friends.My husband is pissed at me and Cindy. Emily is super upset that she doesn’t have people to eat with and I am wondering if I made the right call or if I am being a jerk.Edit: common questions be I know I have a lot of comments. Hobbies- knitting, tree shaping. She quit art club, I have tried multiple time to get her into clubs ( she quits usually)Oldest just doesn’t want her to invite her to her table, the my have a good relationship in general.",
	"decision" : "Not the A-hole"
},
{
	"title" : "AITA for pretending to not understand Japanese and making a kid cry?",