[
{
	"title" : "AITA for refusing to give up me extra seat for someone else’s toddler on a flight that I paid for because I’m fat?",
	"body" : "I 34F am obese. I’m actively working toward losing weight and I’ve made progress but I’m still obese as I’m typing this.I’m going over to see my brother and his husband for Christmas across the country and because I’m fat, I booked an extra seat so everyone can be more comfortable. I know it sucks having to pay for an extra seat but it is what it is. I know Southwest Airlines has this “customer of size” policy but I’ve had some bad experiences with Southwest even before I was obese so I wasn’t doing that and it’s mostly my fault I even got fat.Everything goes smoothly from checking in to security and boarding, at least at first. This woman comes to my row with a boy who appeared to be about a year old. She told me to squeeze in to one seat so her son could sit in the other. She told me, not asked. I told her no and that I paid for this seat for the extra space.She makes a big fuss over it, which got the flight attendant’s attention. She told the flight attendant I was stealing the seat from her son, then I showed my boarding passes, proving that I , in fact paid for the extra seat. The flight attendant asked me if I could try to squeeze in, but I said no, that I wanted the extra seat I paid for. The boy, who the mom said is 18 months old was supposed to sit in her lap so he could do just that. The flight attendant eventually told the mom to put her son in her lap. I got dirty looks and passive-aggressive remarks from her for the entire flight and I do feel a little bad because the boy looked hard to control so AITA?EDIT: I did not fly SWA",
	"decision" : "Not the A-hole",
	"valid" : "true" 
},
{
	"title" : "AITA for not wanting to share my birthday with my dead twin anymore?",
	"body" : "16 f here, soon to be 17 in 3 days. I was a twin. My brother died hour's after birth. He was 5 minutes older then me. I was told my mother went into deep depression, but with help got better over time. I've watched videos of my birthdays from 1-6 year old, and me sharing my birthday with my brother has started at my 1rst birthday. There's always that 5 minutes of remembrance in honor of him, and instead of having one candle on my cake there will be an extra or extras for him. For example, if I was 1 year, there will be 1 for him or if I was 2, then they would add another 2 and so on.As a kid, I didn't really understand or minded, because I got to blow out extra candles. When I was 8, I did question it and they told me it was in remembrance for my brother since we share the same birthday. This carried on until my 16th, that I didn't get to celebrate, because I ended up in hostpital. My grandpa showed up at the hostpital while I was recovering with a gift and wished me and only me a happy birthday. After he left, I realized, I loved that he only acknowledged me. I realized, I didn't want to keep sharing my birthday with my brother. But then I felt guilty. I did try and speak to my parents about me just me celebrating my birthday this year. But I was brushed off.Now we come to what happened 4 days ago and my grandpa, who is the official cake maker in my family, asked what type of cake did I want? I told him and added firmly with only 17 candles please. My parent's were in the next room and immediately they came in demanding to know what I was doing? That I should know that the other 17 candles were for my brother and I ended up crying and told them, that he's not even here and I am. I can't remember everything that was said but there was alot shouting with me and my parent's and grandpa and me getting told that I'm selfish and I need to stop being self-centered. Grandpa left with me. I've at his house since the big fight. I've been crying alot and Grandpa been here for me, but I feel so guilty and to need to ask AITA?",
	"decision" : "Not the A-hole",
	"valid" : "true" 
},
{
	"title" : "AITA for wearing my wedding dress to someone else’s wedding?",
	"body" : "Please read the whole story before jumping to conclusions.I (20F) married my husband two years ago. We aren’t rich and don’t care that much about weddings, so I wore my prom dress to my wedding. It’s not a super fancy dress or anything, it’s basically a long sequin dress in deep dark blue with one sleeve. For the reference, the dress . My friend Ciara (22F) was attending my wedding. Since the wedding, I wore it on a few occasions because it’s basically the only one fancy dress I own.Recently, Ciara was getting married and I was obviously invited. The wedding color scheme was dark blue and she requested fancy attire, so I thought my dark blue dress would be fine. It’s not white and it’s not even remotely close to a wedding dress. I also didn’t feel like wasting money on another fancy dress that I wouldn’t ever wear again, especially since we aren’t rich.So I showed up at her wedding in my dark blue sequin dress. It wasn’t standing out or anything, most of the guests were wearing even more fancier dresses. However, when Ciara saw me, she lost it.She yelled at me in front of all the guests, in front of her husband and my husband, saying that what I did was horrible and that no one shows up at a wedding in a wedding dress. I tried to reason with her, saying that the dress isn’t a wedding dress, it’s the only fancy piece of clothing I own, I wore it to multiple occasions before and after my wedding. She didn’t listen and kept yelling at me to the point her bridesmaids and her husband started trying to calm her down. She also said a bunch of unsavoury names to me.I was very upset with the drama and decided to leave with my husband. Then I started getting texts from Ciara, who blamed me for upstaging her on her wedding day, for driving a wedge between her and her husband since he said that she overreacted massively and upset her friend over a dress. I decided to ignore them because I think she is being unreasonable, but a part of me thinks that I was an AH because I wore the dress to my own wedding.",
	"decision" : "Not the A-hole",
	"valid" : "true" 
},
{
	"title" : "AITA for refusing to attend my inlaws' christmas unless SIL removes the stocking that has a different name than the one I chose for my unborn son?",
	"body" : "To preface, I (F) have been with my husband Todd for 3 years. He has a son (9) from his late wife. Todd is pretty close to his sister Monica. Their mom's deceased and Monica has basically taken over. She's nice to me and all but she seems to be a bit controlling especially when it comes to Todd. But that wasn't a real issue until after I got pregnant. After we found the gender of the baby (boy) she insisted on the name \"Tommy\" but I refused because I already had a name in mind and Todd loves it but he chose to stay out of the fight saying maybe we should just let Monica call him Tommy. I refused and asked her to please respect me and the fact that I'm the mom not her and she said okay.Like always, she's hosting christmas for the family this year and invited me and Todd to christmas dinner. I was intending on coming that is until I'd discovered that she hung stockings with her kids, nephews, neices names and hung a \"Tommy\" stocking saying that it's for my son. I was livid. I lost it on her and there was a huge fight. I told her I won't be coming to her christmas dinner if she doesn't remove the stocking or put the real name and then I left. Todd started yelling at me when we got home saying that I was attempting to ruin an important family tradition by refusing to come and said that I was overreacting and cannof be telling his sister what she should or shouldn't do in her own home. He tried to convince me to come but I said no. Not until she removes that stocking and it doesn't look like she's going to do it cause he spoke with her and he's now mad at me for \"making a huge deal out of it\". Her husband Philip who's usually nice to me called yesterday saying that he spoke with Todd and he'd be devastated if I cause \"the family\" to miss the event at Monica's house and ruin it not only for the adults but for the kids as well since my stepson loves spending the holidays with his cousins.Todd has been quiet and the only way we communicate is through Philip. I feel ashamed. Maybe I overreacted. AITA?Edit# to answer someone's question, no, I did not ask Monica to put a stocking for my son (she said it was for my son) It was her decision although I find it weird since the baby isn't even born yet.",
	"decision" : "Not the A-hole POO Mode",
	"valid" : "true" 
},
{
	"title" : "AITA for banning my teenage nephew from my house and keeping my family away from him on Christmas?",
	"body" : "On Thanksgiving my daughter lost her airpods. We did the fund my AirPods and they was at my sister’s house in my nephew’s Adam (13) bedroom. He claims it was a “mistake” and he thought they was his. But when we got them back the airpods was still in the pink doughnut carrying clip that my daughter uses. Adam has had a lot of “mistakes” over the years from taking gaming controllers, airpods, toys that he randomly finds. This has been an ongoing issue and I think at 13 it’s time for Adam to stop having this mistakes. I told my sister Adam isn’t welcomed at my home for Christmas because he has had mistakes there and has steal other people’s things.I don’t think I’m being mean but I’m sick of the little thief who has no consequences and I don’t want him in my home anymore. Because of this my mom is now hosting Christmas because I don’t want to. I made it clear to my family why. I think it’s past the time we address Adam’s issue. My mother and sister think I’m going about this the wrong way and I’m being way too mean on Adam over a little mistake but I’m honestly just sick of being around him. I had to tell my kids not to take any expensive or new gifts they like to grandma’s. I have also told them no sharing with Adam and any gifts we unwrap at grandma’s goes straight to the car and locked in. The situation pisses me off because I now feel like I have to punish my kids for Adam’s behavior and they can’t play with their own things on Christmas and be vigilant because their cousin steals and no one but me seems to give two shits about how wrong that is.",
	"decision" : "Not the A-hole",
	"valid" : "true" 
},
{
	"title" : "AITA for refusing to pay for my sister’s wedding dress when she insulted my career?",
	"body" : "I (28F) am a self-taught graphic designer and have worked hard to build my career. My sister (25F), on the other hand, has always been critical of my job, calling it a ‘hobby’ and not a ‘real job’.Our parents passed away a few years ago, and I’ve been more of a parental figure to her since then. We’ve had our ups and downs, but I’ve always tried to support her.Recently, she got engaged and was over the moon about planning her wedding. She found her dream dress, but it was way out of her budget. Knowing I’ve saved a bit, she asked if I could pay for it as her wedding gift. I agreed because I wanted her to be happy.However, a few days ago, we had a family gathering where she introduced her fiancé to our extended family. During the dinner, she made a snide remark about my career, implying that I was still ‘playing with my computer’ while others had real jobs.I was hurt and confronted her later. Things escalated, and I told her that if she didn’t respect my career, she shouldn’t expect me to fund her wedding dress with the money I earned from it. She accused me of ruining her wedding and being petty.I’m torn. I want to support her, but I also feel disrespected. AITA?",
	"decision" : "Not the A-hole",
	"valid" : "true" 
},
{
	"title" : "AITA for not putting a stop to my stepdaughter “correcting” the food the host made",
	"body" : "I (32f) have been dating a widower with a daughter, Nara (12f), for a year. We currently moved to a new city because of my boyfriend’s job promotion (I freelance) and are in the middle of settling down. Nara and I get along very well.Nara plays tennis. Since the move, she’s been in the school team and competed a bit. The parents of her teammates often organize some kind of get together and her father and I tried our best to have her attend most of them. I would say Nara got along well with all her teammates and I thought the parents were friendly. Last week the team captain’s parents hosted a potluck party at their place.Nara and I brought over some brownies. There really was a lot of all kinds of food. The team captain’s father did most of the greeting telling us his wife was preparing something special for us all. Once everyone was at the party, the wife came out of the kitchen with a special dish, a recipe of a specific country.Now, Nara looks white but her late mother actually came from that very country. The wife host began to serve everyone and share her recipe and ingredients and how it was “not that difficult to make once you substitute the local ingredients” and feel free to ask her for tips.At this point Nara spoke up, saying that the authentic recipes included such and such and how their particular scent and taste added to the whole experience of eating the dish. She said if so many substitutes were used, they may as well call the dish a different name. The wife host looked a little unsettled and told Nara that she and her husband traveled a lot in their youth and she had the dish many times and knew what it was supposed to taste like and the substituted ingredients work just fine. Nara then said her mom was from the dish’s country of origin and she understood that some ingredients were hard to come by but substituting so much turned the dish into something else altogether.During all this I mostly kept silent. Nara was not being rude, just matter of fact, and as this was a matter of her heritage I thought she could speak up. The host wife spluttered a bit before saying everyone should just go ahead and enjoy her dish, no matter the name. Everyone tried though nobody asked for seconds (I personally thought it was a little bland) and there was a lot of leftovers.Nara’s team captain later called her, thanking her for putting her “annoying stepmom in her place.” When my boyfriend came back from his business trip and learned of this, however, he thought I should have reprimanded Nara for being rude to the host. He also had a talk with Nara and she seemed to be sulking a bit though she was not grounded or anything. AITA?",
	"decision" : "Asshole",
	"valid" : "true" 
},
{
	"title" : "AITA for blocking my door off to my room with my bed to prevent my cousins from using it as a guest room?",
	"body" : "Backstory: I (15F) was born in Madrid, Spain to Spanish parents but we immigrated to the U.S. when I was 1 and we've lived here since. We do go back to visit my grandparents and what not but this year, they came to us.I live in a small, 2 bedroom house with my parents. I'm an only child so I get one room to myself and my parents get the other. This isn't enough space for my grandparents plus my uncle and his wife and kids. My grandparents booked a hotel near to our house but my uncle is too cheap for that. He wants ME to give up my room for his kids while he and his wife sleep on an inflatable bed beside them in my room. I explained that I have sleeping issues and would appreciate keeping my room. He kept insisting and annoying my parents about it till they finally caved in and told me to sleep on the couch in the living room. I didn't want to give up my room, so when night time came last night I rolled my bed to the door and locked it for extra security so they couldn't get in. OF course, they were upset and tried to get more to open the door and let them in but I didn't budge. I kept my room for the entire night.Morning time, I wake up expecting a shit show. Basically, I got yelled at for having a 'tantrum' and not making a small sacrifice. I understand what I did seems like a tantrum but I don't feel like they are entitled to my room. I pointed out that my grandparents got a hotel and that they could have done the same. AITA?",
	"decision" : "Not the A-hole",
	"valid" : "true" 
},
{
	"title" : "AITA for refusing to volunteer as a doctor on a flight?",
	"body" : "I’m (M, mid 30s) a medical doctor working as an internal medicine hospitalist at a major hospital. Recently I was on a long haul international flight. Usually I sleep on flights but this was during my waking hours so I decided to spend my time enjoying the inflight entertainment and free drinks. I had already been drinking even before the flight while I was in the lounge. I was not slurring or excessively drunk but I was feeling a strong buzz. Usually I don’t chat with my co-passengers, I just sleep or do my own thing. On this flight the configuration of the business class cabin was such that the passengers in the middle row were practically just beside each other. There was just a small barrier separating me and my co-passenger (F, mid 30s) that could be raised but it still didn’t do much to separate us. She started up a conversation and being a little intoxicated, I was also feeling chatty. When she asked what I do I mentioned I’m a doctor and I work at such and such hospital. After some more small talk we both started doing our own thing.I was trying to watch my movie and enjoy my drinks when an announcement was made asking if there was a doctor on flight. Normally I would present myself to the cabin crew and help out but after several hours of on flight boozing, I was pretty drunk. I was not able to think clearly and probably would have done more harm than good in such a situation. I didn’t react to the announcement at all. I continued watching my movie and drinking my drink. My co-passenger tapped  me and said they just announced they need a doctor. I replied that someone else would help or they would get instructions from the medical team on the ground. She tried convincing me to go help but I refused. She then said I was an unbelievable AH and if the passenger died it was my fault. I said listen lady, just because I’m a doctor doesn’t mean I’m not on call 24/7 to provide medical care on demand. I work when I’m at the hospital, outside I’m just like everyone else and I’m entitled to drink and relax. She had a disgusted look on her face but didn’t talk to me after that. I didn’t want to engage with her either.I’m not sure what happened to the passenger who needed medical assistance but since I didn’t hear any more announcements I assumed all was well. While exiting the aircraft this lady called me an AH again.In my mind, I’m very clear that since I was intoxicated I could not provide medical assistance. I was drinking on my own time and there was no expectation that I would need to be sober. Doctors get to enjoy life too, I can’t stay sober on every flight just in case there’s an emergency. I don’t think AITA, but I thought I’d get external opinions. AITA?",
	"decision" : "No A-holes here",
	"valid" : "true" 
},
{
	"title" : "AITA for telling my sister \"don't dish it if you can't take it\"",
	"body" : "I (25F) am home for the holidays, so I'm seeing my sister Ella (18) and brother Finn (17) for the first time in months. To put it simply, Ella tortures Finn. Finn can't open his mouth around her without her getting angry. She makes fun of his hair (he wears it long), his clothes, his hobbies, his friends. For example, I mentioned I was thinking of taking on extra work, Finn said thats a good idea because my rent has gone up. Ella responded \"since when do you have a finance degree\" even if, frankly, he was right. He tripped up the stairs last night, she told to stop pretending to be drunk (he was drinking with his friends downstairs). Ella seems to think its all a joke, but it upsets Finn. Finn asked if we wanted to watch a movie tonight and suggested one he likes, Ella responded \"not everything is about you\". Finn wore a t-shirt of a band he likes, Ella complained he doesn't even listen to them. And on and on it went.Yesterday, we went to a little coffee place. The usual “joke” arguments happened all the way there. The trouble started when Finn accidentally knocked the table, and Ella exploded, saying “there’s hot drinks on this table, would you be careful” and then yelling some more when Finn said it was an accident. I tried to defuse it and told Ella to stop, she replied “You need to learn to take a joke”. When I told her she was taking it too far, Ella kept on complaining. She gave us the silent treatment, even when Finn asked about her plans, and when she gave a blunt answer, turned to me and said “sorry did I take that too far again?”. I told her yes, and she started yelling at us again about how we gang up on her (we don’t).Here’s the issue; during the commotion, Finn made a remark about Ella’s friends (I didn’t hear this, but Ella was very upset and Finn admitted he said it). Last year, some really bad shit went down between Ella and her friends that really upset her, so he touched a nerve. Knowingly or unknowingly.And I was sympathetic, as from what I saw happened, it was bad bad and it messed her up. And Finn apologised. But, I was on Finn’s side, because Ella had ripped into him non-stop. So Ella was yelling at Finn, and our mum was telling the both of them to make up, I stepped in remembering all the crap Ella pulled, and said “Ella shouldn’t dish it if she can’t take it”.And yes, it was harsh and I shouldn’t have said it. But I felt like someone needed to put Ella in her place, because all she did until then was whine about me “babying” Finn and Finn’s inability to “take a joke”. Ella stormed off crying, My mum told me it wasn’t my place to tell her as I’m only seeing part of what’s going on-apparently they’ve been at each other since she got back. And maybe that’s true but all I see, even before I moved out, was her antagonizing him and him giving her more grace than she deserved.Now, Ella is not talking to me. My mum is insisting I stay out of it and we all make up for Christmas.So, AITA?",
	"decision" : "Not the A-hole",
	"valid" : "true" 
},
{
	"title" : "AITA for snapping at my SIL after she kept insulting my husband?",
	"body" : "I have a SIL, “Alison”, who is married to my brother “Harvey”. I will be honest, I don’t like Alison. She’s the most negative, bitter person I’ve ever had to spend more than an hour with. She has a negative opinion about everything, but notably, my husband. Most of the time I just brush it off but we’re all at my parents’ for Christmas and her comments have been constant.Example 1 - She hates that me or my husband refer to him looking after our daughter as “babysitting”. Unpopular opinion nowadays, but I don’t mind it. We actually both use the term for when one of us wants to do a recreational activity and the other has our daughter. I say “he’s at golf so I’m babysitting” and he’ll say “she’s going to dinner so I’m babysitting”. However, Alison is only upset when my husband says it.Example 2 - She needles him by asking pointed questions that she thinks “any mother would know” and then gets smug when he doesn’t know the answer.Example 3 - Every time I do anything with my daughter (and I do most things with her around me because that’s what she’s used to) Alison makes comments about me being to be a “married single parent”I’ve told her to stop many times. I’ve told Harvey to stop her many times. Nothing works. My husband and I have an agreement that we don’t fight with the other’s side of the family so I feel bad that I haven’t been able to do anything about Alison’s comments.Then, two days ago, we were all in the dining room, with the exception of my husband who was finishing up some work. Alison remarked that she hasn’t seen him all day and that it was really rude that he wasn’t putting in more effort to spend time with his daughter or the family. I sternly told her that my husband is working to provide for his family and that not everyone can just take weeks off at a time. Alison then said “of course you’d say that, you’re basically paid to be his bang-nanny” (I’m a SAHM). I cannot remember the last time I was so enraged. Before i could even fully process my own thoughts, I said “Yeah, and you get cheated on for free. Tell me who got the better deal”.For context, everyone knows about Harvey’s indiscretions, but I guess Alison didn’t know we were aware.Alison went silent, then left the table. It’s been two days and she hasn’t said a word to me, barely any to anyone else, won’t even make eye contact. Harvey is livid that I brought it up, but I told him he had his chance to make her stop and he didn’t so I did. My dad said she fucked around and found out, my mom said she feels bad because Alison is quite obviously humiliated. I said she earned it from how she was always trying to embarrass my husband, but my mom says it’s different because no one took her seriously. I think she threw a stone straight through her glass house but she does seem really miserable so I’m wondering if I’m the AH?",
	"decision" : "Not the A-hole",
	"valid" : "true" 
},
{
	"title" : "AITA for telling my cousin's widow I will no longer be supporting her emotionally or physically?",
	"body" : "I(32f) am from a small, tight knit family. There is my family of 4, my parents, my grandmother, my aunt and uncle, their two kids and families. We all live in the same area and will do whatever we can to help eachother.My cousin, Derek(28m) tragically passed away a year and a half ago from a drunk driver. He left behind his wife, Monica(27f) and 4 kids, all under the age of 8. It was devastating and Monica completely shut down. We all understood and started caring for her and the kids. This included me no longer charging her rent(they lived in a house I own, next door to me), helping prepare meals, taking care of the kids, helping with appointments, school work, shopping, ect. I can't tell you how many times I was her shoulder to cry on. She let me put the kids in therapy but refused to go herself.On to the now and the issue. As I said, it's been a year and a half... and she is still completely shut down. She doesn't work, she doesn't cook or clean, and I have been raising the kids along with my 2. This isn't sustainable. The kids miss her. They lost their mom the day they lost their dad.I sat her down the other night and was trying to be empathetic towards her but nothing was getting thru. She just kept crying and saying she couldn't do it without Derek. I told her she doesn't have a choice. She has 4 kids who need their mother. She still wasn't listening but I had enough. I told her she has a week to get an appointment with a therapist before I stop supporting her and went for custody of the kids. She ran out crying.The rest of our family thinks I'm being cruel because she loved my cousin deeply but I think this is what she needs. She can't live like this and can't keep putting her kids thru this!",
	"decision" : "Not the A-hole",
	"valid" : "true" 
},
{
	"title" : "AITA for not buying my son a car like I did for the rest of his siblings.",
	"body" : "I (49M) have four kids, twin boys (both 27), one girl (25F) and another son (21M). This post is about my youngest son, Jack. Since they were children, I promised my kids two things, one, I’ll fully pay for all of their college expenses (housing/tuition/food etc) and two, once they graduate college, I will buy them a car. I kept that promise for all my kids, except with Jack and now I want to know if I am an asshole for that. I paid for Jack’s college expenses, but I am refusing to buy him a car, below is some of the reasons why:I co signed my name on the lease for Jack’s room that he rents with a friend, and I send Jack his portion of the rent every month. The friend started taking advantage of my name being on the lease and stopped paying for rent too, knowing I will cover the amount because I don’t want missed payments on my credit score. I asked Jack multiple times to ask his roommate to pay his portion, but the boy did not care to even respond to me and I ended up paying for six months of his friend’s rent too until I finally solved the problem by getting my name out of the lease.Jack have a very rude and entitled attitude. He speaks to us like we are his low performing employees, the only time he contacts us is when he wants money and goes no contact otherwise, and we don’t know what we ever did to him to treat us that way.Last year when my wife had to be hospitalized, all of my kids flew back home to be there for their mother. Jack didn’t want to but one of his siblings bought him a ticket and talked him into flying out. Instead of being glad to be beside his very sick mother at the hospital, he spent the entire visit making everyone run errands for him (his sister has to cook a very specific type of meal for him/we had to drive him to the gym at a very specific time he demands etc) and acted like it was one huge inconvenience for him to have to fly out.I even talked to my other kids about  whether we were bad parents that caused Jack to act this way but all my other kids don’t know why he ended up so entitled and spoilt. The rest of my kids are extremely different  from Jack, we all get along with each other and care about one another.  For the rest of my kids, I spent maybe $100K on each kid’s total college expenses.  With Jack’s  careless spending habits and unwillingness to save us any money, Jack’s college years ended up costing me $180k. So I refused to buy the promised car. Jack’s upset and has gone to his grandparents complaining about me. My MIL already hates me and now is calling me an asshole saying I am playing favourites because I bought everyone a car and not Jack.",
	"decision" : "Not the A-hole",
	"valid" : "true" 
},
{
	"title" : "AITA for telling my friend her daughter is banned from my home after accusing my daughter of bullying",
	"body" : "This is some drama so I will try to keep it as clear as possible. My daughter used to have a friend name Kat. They were besties in preschool until middle school but slowly grew apart. They are both in 8th grade.Now my daughter is popular and Kat isn’t. I have heard about it from my friend a lot. My daughter invited a few girls ice skating at the beginning of the month. Kat wasn’t invited and they had a text fight about it. It wasn’t a pretty fight, I’ve read it. Overall friendship completely over.A few days later I get a call from the principal for bullying. I got in and the evidence was the  text fight and areas were missing. Kat deleted her response so it just looked like my kid was bullying her. I showed the principal the whole thing on my daughters phone.Basically got dismissed and teachers will keep an eye on it. My daughter kinda hates Kat now.The issue is retracted an invite to Kat for the holiday party at my home tomorrow. I got a call from my friend is pissed, saying we should help the girls make up. I told her she is banned from my home and she called me a jerk. Kat is apparently extremely sad and I need more opinions.",
	"decision" : "Not the A-hole",
	"valid" : "true" 
},
{
	"title" : "AITA for embarrassing my uncle by asking him to leave my wedding?",
	"body" : "I (34 M) had my wedding yesterday with my wife Lisa (34 F). A lot of our relatives/friends attended, including my uncle, who's in his mid eighties.He's never cared about me since I was born, and has not checked in with me either. He was virtually non-existent throughout my life. Years ago, when we were homeless and required help, we reached out to him to lend us some money/help us find another house (he's really rich and has a lot of connections) but he refused anything and never bothered to ask what had become of us either.I didn't want to invite him to my wedding, but my parents said I had to, and in the end I did. He came along with his family, and before the wedding ceremony, he came to me and said congratulations, and then stated \"Congratulations. I have also brought you an expensive present, unlike your loser of a father who could not give you much of anything.\"I was shocked at the comment. He was just smiling at me, but I lost my temper and said I don't want anything from him. I yelled at him and asked him to fuck off from the wedding, etc. It resulted in a huge scene and in the end he had to leave, along with his family who were also yelling at me.My other relatives present there are saying that I reacted very badly, etc. I am wondering whether I did the wrong thing now.AITA?",
	"decision" : "Not the A-hole",
	"valid" : "true" 
},
{
	"title" : "AITA for telling my mom she should hold her husband to the same standard she holds me to?",
	"body" : "My dad died a few days after my 7th birthday. He was on his way to work and got into an accident. I loved my dad and have missed him so much since he died. Mom and I both went into grief therapy after his death. She went for about 6 months. I went for almost 3 years.A few months before I stopped attending therapy my mom met \"Mark\". I didn't meet him for like a year and a bit after but mom told me she was dating someone and then when they became boyfriend and girlfriend. They got married like 7 months after I met him. I was 12.Even before they got married Mark and my mom would call me their daughter and say I was their kid. He would tell people I was his daughter when he met them. Whereas I always called him my mom's husband or fiancé before they got married.It bothers my mom and Mark that I don't tell people he's my dad or say \"my parents\" when I'm talking about both.Over the years they have told me it would mean a lot to Mark if I were to introduce him as my dad. Or she said I could say bonus dad, but not stepdad, since that sounds far more insignificant in terms of the role he plays in my life.I have never done this. But for a couple of years now my mom has told me I should be better than this, I should think about someone else's feelings above my own. That it would cost me nothing to let people see him as my parent instead of instantly delegating him to just the dude she's married to. She has gone on and on about thinking about his feelings and not putting my own first the whole time.Lately it has been getting to me so when mom said it to me (17f) a couple of weeks ago I told her she should try holding her husband to the same standard she holds me to and ask him to put my feelings on this before his own.My mom told me he already has to do that day after day when I refuse to acknowledge him as a dad in my life. I told her he had a choice on whether he wanted to marry her and take me on. I never got a choice in his place in my life. But I told her I am taking back that right to choose what he is to me whether she likes it or not.She told me it was petty for me to claim he needs to be held to the same standard when his actions don't hurt me but mine hurt him.AITA?",
	"decision" : "Not the A-hole",
	"valid" : "true" 
},
{
	"title" : "AITA for cancelling my aunt’s invitation to my wedding when she traveled the world to attend it ?",
	"body" : "My husband and I (26F) got married three weeks ago. My husband is from South Africa but I am French. So our wedding in the Savanah in South Africa was a huge trip for the 13 French guests. We rented a beautiful lodge where you see lions, elephants, etc. And to thank everyone for coming all this way, we rented it for 2 days. Day 1 : Wedding. Day 2 : pool party.We only invited 30 people, the people we love. I had a huge argument with my aunt (38F) 8 years ago and we cut ties ever since. But doing the invitations, I thought about how close we used to be. I decided to invite her.There was no +1 for anyone and so I only invited my aunt. Not her partner or her kid since I barely knew their names.My aunt said she was happy but insisted that we invite them. I told her no, but my mom teamed with her and pressured me A LOT during the year. I explained that the ceremony meant everything to us and that we only want people we love to be present.But my aunt booked flights for her but also for her family. She said it was a family trip but added that she heard some of my guests cancelled and so that there is now space for her family. I told her that it would not be happening but that her family could join us for the pool party the next day.After that, I got even more pressured by my mom into inviting them for the wedding itself because « they are coming all this way ». But I kept refusing and tried to finish my dress without my mom.On the big day, after the ceremony, my husband and I left for an hour in the Savannah with the photographers to make a few photos. As soon as we came back to the lodge, my aunt came to me, smirking. She was holding her kid, her partner was behind her.I’m not the scandal type, I didn’t know how to react. In my disbelief, I kissed the kid hello and shook hand with her partner. I immediately felt sad for not defending myself.I then heard my mom and grandma telling my aunt about the extra chairs and food we had and that her family must stay for diner.My sister lied for me, saying we don’t have enough chairs because some are broken. So my aunt announced that they were leaving. I asked why leaving with them, she was supposed to stay for the dinner and they are only 5 mn away. She replied that she never intended to stay for dinner but that she will spend time with us when they come back tomorrow for the pool party day. I was shocked.I replied that I had a change of plans and that she and her family could not come for the next day anymore. My mom, usually lovely, lost it and told me that I had no right to cancel my aunt’s invitation to the pool party. I reminded her that we paid for the whole wedding ourselves and that she has no say in who I host. And I walked away. But she yelled at my back in front of everyone. She was screaming that the conversation was not over and that I better come back. My sister had to physically bar my mom from running after me.I still stood my ground and kept my aunt from coming back the next day.AITA ?",
	"decision" : "Not the A-hole",
	"valid" : "true" 
},
{
	"title" : "WIBTAH if I cancel my cousins plane ticket and ruin his friends vacation?",
	"body" : "I (23F) am very close with my cousin, (20M) we were raised together so we are pretty much like siblings. When I turned 18 I moved away from home and so we rarely see each other anymore, during a FaceTime last week I proposed the idea that he flies out to my home to stay for a long weekend and we can catch up. I bought the plane ticket in full myself but he does plan to pay for half of it, I already have the time off work approved for when he gets here and I’ve been planning fun activities for us to do when he arrives.Heres where I might be the AH. I live in a very popular vacation spot, yesterday he asked me if one of his friends could join him for the trip to my home and that he already invited her. I told him I haven’t seen him in over two years and wanted to spend this limited time with him, I also expressed that I am not comfortable housing a stranger in my small home, I’ve only got two bedrooms.After I explained this to him he left me on read all day,  he just texted me back saying that his friends mom went ahead and bought her a plane ticket here anyways and they are both fully expecting me to pick her up and house her for the duration of the trip.I told my cousin that his friend needs to look into securing sleeping and transportation accommodations or get a plane ticket refund as I will not be providing her a place to stay or transportation around to activities.He is very upset with me that I would ‘ruin’ his friends ‘surprise’ vacation by not allowing her free accommodation in my home, i feel as though they lied to the friends mother about the circumstances because there’s no way her mom surprised her with only a ticket for the exact days I planned for my cousin to stay here or why they would tell the mother that her daughter would have a place to go after I explicitly said no.Would I be the AH if I cancel his plane ticket?TLDR: I bought my cousin a plane ticket to visit me after two years apart and he invited his friend to join behind my backQuick edit, the friend is not his girlfriend. He has a long term boyfriend who he has been with for almost 3 years and he is violently gay.EDIT 2: thank you to the majority of you all, I took your guys advice and explained to my cousin how I feel being a glorified air bnb/driver for him and his friend is not what I planned for this trip, I told him it was inconsiderate to lead his friend to believe that I would house her without knowing her that she needs to look into accommodations and refund on her ticket. He said he will talk to her and he apologized for the situation but I’m not sure what the outcome will be. Will update when he responds.Update 1: I’ve decided not to cancel. But some clarification, this is not a budget shared time, he’s paying for half his ticket, I am paying for food, gas, activities, shopping. I am better off financially than my family but I am not rich, I make maybe 65k a year (in America) so I had to save up for this, the activities I’ve booked can’t be edited to add or remove participants and they are all over $100 per person, his friend cannot afford it so if she was here she would literally be sitting alone in the car for half the damn time, it’s too hot to take the keys she’d bake, and I don’t trust a random person I’ve never met with my running car unsupervised.For those of you that want to imply nefarious activities between me and my cousin, it feels like yall are projecting. Have you never spent time with a sibling or cousin alone? Were you guys constantly fighting urges when you weren’t alone? It’s weird to assume out of the blue without any foundation. Also, he is gay. We both currently are in relationships.I have not heard back from him yet about what will happen with the friends plane ticket/if she’s coming with her own accommodations. In the future I am not opposed to her coming once I meet her and if I have time to properly plan for it AND if she has time to save up for her portion of activities. As stated in the original post this was an impulsive invitation so it’s been maybe a week since it was planned, neither of them have jobs so it’s very safe to assume this girl has no money saved up for this and it is very expensive here; while the timing was impulsive I do have a savings I keep just for this reason when family visits, spending on her will effectively take away the opportunity of a future catch up holiday with another family member. She is not my priority over family.",
	"decision" : "Not the A-hole",
	"valid" : "true" 
},
{
	"title" : "AITA for agreeing with my brother that his son does not have to treat me with the respect due an elder.",
	"body" : "I 28 am a lot younger than my siblings. My youngest brother is 40. He has a 16 year old son that he has pretty much ignored his whole life. He divorced his ex and quit his job to go see the world when my nephew was 4 and I was 16. His ex stayed in our lives and we have all helped out where we can.My brother is currently in town for a while. We decided to do an early Christmas so he could be a part of it. Except he has been acting like an asshole.In my culture it is common to refer to your elders as sir or ma'am. My brother heard my nephew refer to me a sir and brayed out that he doesn't need to treat me with respect. I'm barely old enough to dress myself. Blah blah. I told him to stfu and not insert himself into conversations that don't concern him. He said that if his son is in it then it concerns him.He kept at it all afternoon. Everyone told him to knock it off but he would not.After dinner my nephew started calling me by my name. I told him that we are in public and I expect him to treat me with respect. He said that his father says he doesn't have to so I asked him if that was who he listened to now. He said yes. I agreed with them that he doesn't have to treat me as an elder.When it came time to open gifts I left what I had bought my nephew in my car. We all exchanged gifts and  it was a good evening. My nephew was kind of disappointed that he didn't get any big gifts this year.My brother was at my house yesterday and noticed that I had a new toy. I decided to keep the handheld computer I had gotten my nephew for myself. It's pretty cool.  It's a full Windows computer but the size of a Nintendo switch.My brother asked why I got a toy when I have all the consoles and a gaming computer. I was honest and told him it was originally for his kid but since I'm not to be respected as an elder I have zero reason to waste money on him.My brother says I'm being an asshole and tried to get my family involved. They all rejected him. He tried to get my nephew to guilt me into it. I asked my nephew what his father got him as a gift. I said that since he wants to respect his father and not me he can get his gifts and such from his father.",
	"decision" : "Not the A-hole",
	"valid" : "true" 
},
{
	"title" : "AITA for not thinking of dinner for my family before I left?",
	"body" : "I (30F) had a funeral to attend with my older son (12M) of his best friends mom who is also one of my best friends .  My Husband (29M) didn't want to go. I left work an hour sooner got the kids settled and got myself ready so As soon as he got home from work I was walking out the door as previously planned...  I only decided to attend with my oldest Son and leave the other children (5M, 6M, 8F, 10M) home with my husband. We left at 3pm and it lasted until 8:30pm we were included in the food after.  I didn't buy or bring food home I assumed that if I was busy my husband could handle it. However, I walked in to Kids starving and my husband yelling at me I didn't buy him food on the way home. (he didn't even ask. So AITA for not preparing dinner or buying dinner?",
	"decision" : "Not the A-hole",
	"valid" : "true" 
},
{
	"title" : "AITA for asking my daughters friend to leave my house",
	"body" : "This happened last week but I still feel very weird about it. I (40m) have a 16 yo daughter Lucy who has a friend Britt (16f). Britt has been friends with Lucy for years and has been to our house countless times. But recently she has been starting to act out in different ways. She used to be such a nice girl but these days she can be quite sarcastic and mean.We recently got a new carpet in our house and my wife made a rule that no one can wear shoes in the house. Britt came over last week and as she was coming in I asked her to take off her shoes. She answered saying “why do you have a foot fetish or something” which I just thought was a really weird and inappropriate response (and also I don’t… but even if I did what would that have to do with anything). I said no it’s just that we get this new carpet and we don’t want it to get dirty. I thought I heard her say your dad is so weird or something as they were going up the stairs.Later when they came down for some food Britt was wearing some bright pink socks that I assume were Lucy’s as she wasn’t wearing any socks when she went upstairs. They caught my eye and she saw me glance down at them and she said to Lucy “see I knew I should cover them up” which to be fair Lucy replied something like “oh shit up Britt stop being dramatic”. Anyway I was feeling uncomfortable so I just said “Britt please can you go home now” she just laughed and said I’m going soon anyway and I said no I want you to leave now please. She got her stuff and left.After that Lucy was mad with me. She said that Britt was only joking and I completely over reacted. My wife also said that she didn’t agree with the way I handled it. It all just felt really off to me though. I don’t know if I should just laugh it off or not.",
	"decision" : "Not the A-hole",
	"valid" : "true" 
},
{
	"title" : "UPDATE: AITA for not going to the wedding of my dad and his affair partner?",
	"body" : "First post: HereHello,First I want to thank all who commented on the first post and all who messaged me. It really helped me stick with my decision to not go to the wedding. I wanted to update earlier but its been pretty hectic with work.So, after the many texts and calls from multiple family members, I sent a text to all the numbers detailing what dad did and why I choose to be no contact with him. I then blocked all the numbers. I have changed my number but kept the old number in a separate phone to collect evidence if they start to harass me from random numbers. But luckily nothing happened and I thought that was that.A week or so after that, my aunt's fiancé came to my apartment. He knows what time I get off work and was waiting for me in the parking lot. I was apprehensive but he assured me he only wanted to talk. And according to him the text I sent has caused a shitstorm in that family. He told me that some of the cousins who did not know what happened in the past started to question dad and affair partner and they started to get defensive and deny it but someone revealed that it was true. This has caused a massive argument within the family with some cousins pulling out of the wedding. Dad wanted to postpone the wedding so he can talk to me but the affair partner threatened to leave him if he did that. The news of what dad and affair partner did also reached some of their friends who were at one point friends of my mom as well. Some of them has also pulled out of the wedding and this caused the affair partner to have a breakdown and started banning anyone who brings it up, family members included from the wedding. According to aunt's fiancé she is blaming this all on me, says I did this intentionally. I laughed at that. The wedding is still somehow happening.I asked him about my aunt and how all this started and he said all he knows is that there was a conversation of how bad the family would look if I wasn't at the wedding and that my aunt offered to call me. He said that he disagreed but she did it anyway. He said that he is only here because he felt I needed to know what happened. I thanked him but said I will be going completely no contact with her and by extension him as well. He agreed, wished me well and left.I am not going to lie and say I am completely ok. I miss my aunt. I miss my mom. But I know what I did was the right thing. I am currently staying with my girlfriend and she has been cheering me up by coming up with absurd ways to ruin the wedding. As a lot of you said, I should try therapy and I am going to take that advice. Some of the comments has made me realize that I have bottled up a lot of grief and anger. I am super nervous about it but I also feel it'll do me good. So, once again, thank you for all your comments and advice. Ciao.",
	"decision" : "UPDATE",
	"valid" : "true" 
},
{
	"title" : "AITA for demanding apology from carer/husband for not feeding me properly after major surgery?",
	"body" : "Last night I sent a text to my husband saying Fuck you if you can't apologize. Now he won't talk to me.Background. I've been the main cook for this family for 17 years (I'm 40y). We have five kids, he is nearly 50y and he rarely cooks, but he is capable of cooking. 7 days ago I had a total hip replacement (planned) I'm on crutches and a lot of pain meds. He is my carer.Yesterday 7pm he said he would start cooking dinner. I was concerned, and starving, and I asked him what dinner was. He said he was defrosting FROZEN chicken breast (for a Hello Fresh meal).To set the scene, the lunch he served was 1/2 small plate of broccoli and sweet potato, no protein. Breakfast was a banana and a cuppa - I had to ask for 1 slice toast. So by 7pm, I was starving, helpless, and in pain.When he said frozen chicken, I yelled, \"I know there's food in the fridge please just bring something!\"Plan B was microwave lasagna leftovers which a neighbor delivered the day before, which he \"cooked\" (ie threw in the oven). Lacking protein, I started yelling again, \"I can't believe you can't find something proper, 17 years & I can't even trust you feed me?\" *Edit - lasagna is Woolworths brand basic lasagna. Not homemade. Neighbor was very kind to deliver it but not high in protein.He got mad saying \"Don't you want food? I am offering chicken or lasagna with salad, what more do you want? How are you mad, I am offering you a choice!\"I felt betrayed, disappointed, and unloved. But I needed to eat, so I told him lasagna. He served it, I eat and I go to bed.After 30min, I'm still mad so I texted him: \"I didn't think I would have to spell it out, feeding a person is not difficult. Your \"plan\" of defrosting frozen chicken at 7pm is fucking ridiculous. Please have a nutritious meal for me tomorrow. The trust I had for you has been going for a while now, but this is a huge low. And for you to throw a fit and try and make me look like the crazy one- fuck you if you can't apologize.\" Edit* yes I realise how awful this was. But I'm mad. And I wanted real feedback, so being honest. I usually don't speak like this. But yes the resentment is growing for more reasons, this is just an example...He says nothing and completely ignores the text message. This morning, he goes to work as planned, my 16yo daughter is caring for me during the day, she feeds me well. He comes home at 6pm. Still no apology.He makes the chicken dinner tonight (he defrosted it last night). Brings it to me and then he leaves silently. He parks himself in front of the TV. I eat, and finish, but I cannot take care of the dirty plate, so it's sitting beside me on the bed.Ten minutes after I eat, I use crutches to hobble to get my own medication, and he ignored me while I struggled to get a glass of ice water and take the meds. It's an obvious struggle and he is choosing to ignore me. I manage to take the meds, and as I walk by him to go to bed, he says nothing. He just now crawled into bed and is near asleep. He hasn't said anything to me yet. No \"how are you?\", no apology, no consideration. Silence.Does he owe me an apology? Or AITA?*Edit for clarification: I'm not sitting around in bed. I'm walking as much as possible, following doctor and PT directions. It's my second hip replacement. First one was in 2018. Early onset osteoarthritis. I can't cook yet though, and he said he would.Update: I apologized at length, He said \"okay.\" Then pretended like it never happened. We spoke briefly about the weather, and he hasn't attended to me since. Thankfully my daughter is bringing meals and I am now able to walk a lot more so I'll be able to self care. I know now what to expect from him - not much.",
	"decision" : "Not the A-hole",
	"valid" : "true" 
},
{
	"title" : "AITA for bringing white chocolate cake when asked to bring chocolate dessert",
	"body" : "I (24f) recently moved to the city most of my paternal families live in. I grew up in another city and went to college on a different coast and wasn’t close with them, spending only 6 Christmas with them growing up. I visited everyone in person once when I moved so they know I’m living in the same city.I’m a pretty good cook and baker, so when I was invited to a potluck family party at my grandparents’ I brought chicken stew which received a lot of praise. One of my aunts asked if I also bake and I said yes, showing them a few pics of my baked goods. My cousin Lisa (30f) then invited me to her little girl gathering, telling me it’s a drink and dessert party and that the theme is chocolate.I made a beautiful white chocolate cake for the party. It wasn’t big as Lisa told me there would be like ten people attending but because it was small I was able to make it a little fancy with silver and white winter decorations. Everyone exclaimed how beautiful the cake was and when Lisa put it on the table it stood out as the rest was different shades of chocolate brown. My cake was praised. The food and drink were delicious. I hung out with my cousins and met Lisa’s friends and her husband’s family. I thought everyone was nice.Later, Lisa called me, not exactly complaining but telling me next time I should keep to the theme of the party. I told her I did as white chocolate IS chocolate. Lisa said that her husband’s sister and a couple of nieces thought it was inappropriate of me to bring a dish that stood out so much, completely ignoring the party theme. They felt all everyone talked about was my cake. They asked Lisa to tell me to “tone it down” or don’t invite them or me to the same party because they can’t stand someone so attention seeking.Personally I don’t think I did anything wrong but this is a group of three people thinking the same thing, so AITA?",
	"decision" : "Not the A-hole",
	"valid" : "true" 
},
{
	"title" : "AITA for sarcastically telling my sister punishing her daughter for going to a movie without her stepsister is sure to help their family?",
	"body" : "My sister, Anna, has a daughter, Piper (16F). Anna is married to Gavin and has a stepdaughter Hazel (16F). Anna and Gavin have been together for 6 years and married for 4. Both girls live with Anna and Gavin full time due to Piper's dad being deceased and Hazel's mom being a deadbeat. Hazel sees Piper as her sister while Piper does not return the sentiment and really doesn't seem to like her very much. She's fine with her but doesn't like to hang out with her and always seems to see spending time with Hazel as a chore. This could be in part because ever since they moved in together Anna and Gavin have decided they will do certain things together every week and they do not get to say no to it. Hazel loves it but Piper hates it.Both girls love The Hunger Games. Piper has read all the novels, including the newest one. Hazel is yet to read the latest novel. The girls also love the movies and so Anna and Gavin decided they would see the new movie together. Piper said she wanted to go with her friends but Anna told her she would go with her sister.Piper went to see it with her friends anyway and Anna found out. She asked Piper why and Piper told her she wanted to go with her friends, she wanted to enjoy seeing the movie and not be stuck with a burden while watching it. Anna decided to ground Piper and told her she will learn to love and appreciate her sister or she will end up grounded a lot until she moves out.Anna was annoyed that instead of being apologetic Piper just complied and has not shown any appreciation for Hazel since. She was telling me all this and I sarcastically told her that it's sure to help their family punishing Piper for going to the movie without Hazel, when she has been telling her for a while in different ways that she doesn't like Hazel. I also made a comment that forced proximity always makes relationships so much better. Anna told me I wasn't a parent of teens so I didn't get it and it was rude to sarcastically talk about her parenting.AITA?",
	"decision" : "Not the A-hole",
	"valid" : "true" 
},
]
